XPavel86/ESp32UniversalRele/Settings.h
#include <WiFiClientSecure.h>
#include <WiFi.h>
#include <ESPAsyncWebServer.h>
#include <AsyncTCP.h>
#include <HTTPClient.h>
#include "ESP32Time.h"
#include <time.h>
#include <ArduinoJson.h>
#include <UniversalTelegramBot.h>
#include <SPIFFS.h>
//#include <esp_task_wdt.h>
#include <vector>
#include <Ticker.h>

#include <esp_sleep.h>

#include "func.h"
#include "Control.h"

//================================
Ticker ticker;
//=================================

bool isSetTimeStart = false;
bool isSetTimeEnd = false;

//=================================
bool isConnectionAttempts = true;
int totalNetworks = 0;

//================================
String scannedNetworks = "[]";
//==================================
String oldBotId = "";
//================================
uint64_t tiktak1 = 0;
uint64_t tiktak2 = 0;
uint64_t tiktak3 = 0;

//==================================
bool res = false;
//bool isUpdate = false;
bool isNewToken = false;
bool isScan = false;
//===================================
const unsigned long BOT_MTBS = 1000;
unsigned long bot_lasttime;

bool isBotToken = false;
String CHAT_ID;
//===================================
int idSetting = 0;
//===================================

struct TelegramUserID {
  String id;
  bool reading;
  bool writing;
};

struct TelegramSettings {
  bool isTelegramOn;
  String botId;
  std::vector<TelegramUserID> telegramUsers;  // Использование vector для динамического массива
  String lastMessage;
  bool isPush;
};

struct NetworkSetting {
  String ssid;
  String password;
  bool useStaticIP;
  IPAddress staticIP;
  IPAddress staticGateway;
  IPAddress staticSubnet;
  IPAddress staticDNS;
};

struct WiFiSettings {
  bool isWifiTurnedOn;
  int currentIdNetworkSetting;
  std::vector<NetworkSetting> networkSettings;  // Использование vector для динамического массива
  String ssidAP;
  String passwordAP;
  IPAddress ipAddressAP;
  bool isAP;
  TelegramSettings telegramSettings;
};

WiFiSettings settings;

//===================================

WiFiClientSecure client;
UniversalTelegramBot* bot;

//====================================

const char* defaultSsidAP = "KolibriAP";
const char* defaultPasswordAP = "";
IPAddress local_IP(192, 168, 1, 1);
IPAddress gateway(192, 168, 1, 1);
IPAddress subnet(255, 255, 255, 0);

unsigned long startTime;
const unsigned long CONNECTION_TIMEOUT = 5000;  // Время ожидания подключения

bool isConnectedWiFi = false;
bool isStartedAP = false;
bool isCertificate = true;
bool isInternetConnected = false;

AsyncWebServer server(80);


//===================================
struct DateTime {
  int setHour;
  int setMinute;
  int setDay;
  int setMonth;
  int setYear;

  String getNowDateTime() {
    return String(setDay) + "." + String(setMonth) + "." + String(setYear) + " " + String(setHour) + ":" + String(setMinute);
  }
};

DateTime dateTime;

//ESP32Time rtc;
//==============================
const size_t MAX_LOG_MESSAGES = 100;

struct LogList {
  String message;
  String timestamp;
  bool isSay;
};

LogList logList[MAX_LOG_MESSAGES];
size_t currentIndex = 0;
size_t logCount = 0;
//=============================
// Функция для получения текущего времени из RTC в формате строки
String getFormattedTimeFromRTC() {
  time_t now = rtc.getEpoch();
  struct tm* timeinfo = localtime(&now);
  char timeString[20];
  strftime(timeString, sizeof(timeString), "%d.%m.%Y %H:%M:%S", timeinfo);
  return String(timeString);
}

// Функция для добавления сообщения в лог с датой и временем
void addLog(String message) {
  String timestamp = getFormattedTimeFromRTC();

  logList[currentIndex] = { message, timestamp, false };
  currentIndex = (currentIndex + 1) % MAX_LOG_MESSAGES;
  if (logCount < MAX_LOG_MESSAGES) {
    logCount++;
  }
}

// Функция для получения всего списка сообщений как одной строки с разделителем \n
String getLog() {
  String result;
  size_t index = currentIndex;  // Начинаем с текущего индекса

  if (logCount < MAX_LOG_MESSAGES) {
    index = 0;
  }

  for (size_t i = 0; i < logCount; ++i) {
    // Формируем строку лог-сообщения с временной меткой и сообщением
    String logMessage = "[" + logList[(index + i) % MAX_LOG_MESSAGES].timestamp + "] - " + logList[(index + i) % MAX_LOG_MESSAGES].message;
    result += logMessage;

    if (i < logCount - 1) {
      result += "\n";  // Добавляем перенос строки только между сообщениями
    }
  }
  return result;
}

//=============================
void sendPendingMessages() {

  int messageSent;
  for (size_t index = 0; index < logCount; ++index) {

    if (!logList[index].isSay && logList[index].message.length() > 0) {
      //String sendStr = "[" + logList[index].timestamp + "] - " + logList[index].message;
      String sendStr = logList[index].message;
      for (const auto& user : settings.telegramSettings.telegramUsers) {
        if (!user.id.isEmpty() && user.reading && settings.telegramSettings.isTelegramOn && settings.telegramSettings.isPush) {
          messageSent = bot->sendMessage(user.id, sendStr, "");
        }
      }

      if (messageSent == 1) {
        logList[index].isSay = true;
      } else {
        //Serial.println("Failed to send message");
        break;
      }
    }
  }
}
//=============================

void addTelegramUser(const String& id, bool reading, bool writing) {
  TelegramUserID user = { id, reading, writing };
  settings.telegramSettings.telegramUsers.push_back(user);
}

void removeTelegramUser(const String& id) {
  auto& users = settings.telegramSettings.telegramUsers;
  users.erase(std::remove_if(users.begin(), users.end(),
                             [&id](const TelegramUserID& user) {
                               return user.id == id;
                             }),
              users.end());
}

void addNetwork(const String& ssid, const String& password, bool useStaticIP,
                const IPAddress& staticIP, const IPAddress& staticGateway,
                const IPAddress& staticSubnet, const IPAddress& staticDNS) {
  NetworkSetting network = { ssid, password, useStaticIP, staticIP, staticGateway, staticSubnet, staticDNS };
  settings.networkSettings.push_back(network);
}

void removeNetwork(const String& ssid) {
  auto& networks = settings.networkSettings;
  networks.erase(std::remove_if(networks.begin(), networks.end(),
                                [&ssid](const NetworkSetting& network) {
                                  return network.ssid == ssid;
                                }),
                 networks.end());
}

//===============================
String getSettingsJson() {
  DynamicJsonDocument doc(4096);  // Увеличиваем размер, чтобы вместить все данные

  JsonObject root = doc.to<JsonObject>();

  root["isWifiTurnedOn"] = settings.isWifiTurnedOn;
  root["currentIdNetworkSetting"] = settings.currentIdNetworkSetting;
  root["ssidAP"] = settings.ssidAP.isEmpty() ? "KalibriAP" : settings.ssidAP;
  root["passwordAP"] = settings.passwordAP;
  root["ipAddressAP"] = settings.ipAddressAP.toString();
  root["isAP"] = settings.isAP;
  root["connected"] = isConnectedWiFi;

  // Добавляем информацию о Telegram настройках
  JsonObject telegramSettingsObj = root.createNestedObject("telegramSettings");
  telegramSettingsObj["isTelegramOn"] = settings.telegramSettings.isTelegramOn;
  telegramSettingsObj["botId"] = settings.telegramSettings.botId;
  telegramSettingsObj["lastMessage"] = settings.telegramSettings.lastMessage;
  telegramSettingsObj["isPush"] = settings.telegramSettings.isPush;

  // Добавляем информацию о пользователях Telegram
  JsonArray usersArray = telegramSettingsObj.createNestedArray("telegramUsers");
  for (const auto& user : settings.telegramSettings.telegramUsers) {
    JsonObject userObj = usersArray.createNestedObject();
    userObj["id"] = user.id;
    userObj["reading"] = user.reading;
    userObj["writing"] = user.writing;
  }

  // Добавляем информацию о сетевых настройках
  JsonArray networkSettingsArray = root.createNestedArray("networkSettings");
  for (const auto& network : settings.networkSettings) {
    JsonObject networkSettingObj = networkSettingsArray.createNestedObject();
    networkSettingObj["ssid"] = network.ssid;
    networkSettingObj["password"] = network.password;
    networkSettingObj["useStaticIP"] = network.useStaticIP;
    networkSettingObj["staticIP"] = network.staticIP.toString();
    networkSettingObj["staticGateway"] = network.staticGateway.toString();
    networkSettingObj["staticSubnet"] = network.staticSubnet.toString();
    networkSettingObj["staticDNS"] = network.staticDNS.toString();
  }

  String output;
  serializeJson(doc, output);
  return output;
}

//============================

void initializeWiFiSettings(WiFiSettings& settings) {
  settings.isWifiTurnedOn = true;
  settings.currentIdNetworkSetting = 0;  // Устанавливаем текущий ID сетевой настройки
  settings.ssidAP = "KolibriAP";
  settings.passwordAP = "";
  settings.ipAddressAP = IPAddress(192, 168, 1, 1);
  settings.isAP = true;

  NetworkSetting network;
  network.ssid = "My home Wi-Fi";
  network.password = "12345678w";
  network.useStaticIP = false;
  network.staticIP = IPAddress(192, 168, 1, 101);
  network.staticGateway = IPAddress(192, 168, 1, 1);
  network.staticSubnet = IPAddress(255, 255, 255, 0);
  network.staticDNS = IPAddress(192, 168, 1, 1);
  settings.networkSettings.push_back(network);
}

//===========================
bool saveSettings(bool wdt = false) {
  if (wdt) {
    // esp_task_wdt_add(NULL);
  };

  if (isUpdate) {
    return false;
  }

  DynamicJsonDocument doc(4096);

  // Создаем JSON-массив для хранения всех сетевых настроек
  JsonArray networkSettingsArray = doc.createNestedArray("networkSettings");

  doc["isWifiTurnedOn"] = settings.isWifiTurnedOn;
  doc["currentIdNetworkSetting"] = settings.currentIdNetworkSetting;
  doc["ssidAP"] = settings.ssidAP;
  doc["passwordAP"] = settings.passwordAP;
  doc["ipAddressAP"] = settings.ipAddressAP.toString();
  doc["isAP"] = settings.isAP;

  for (const auto& network : settings.networkSettings) {
    JsonObject networkSetting = networkSettingsArray.createNestedObject();
    networkSetting["ssid"] = network.ssid;
    networkSetting["password"] = network.password;
    networkSetting["useStaticIP"] = network.useStaticIP;
    networkSetting["staticIP"] = network.staticIP.toString();
    networkSetting["staticGateway"] = network.staticGateway.toString();
    networkSetting["staticSubnet"] = network.staticSubnet.toString();
    networkSetting["staticDNS"] = network.staticDNS.toString();
  }

  // Добавляем информацию о Telegram настройках
  JsonObject telegramSettingsObj = doc.createNestedObject("telegramSettings");
  telegramSettingsObj["isTelegramOn"] = settings.telegramSettings.isTelegramOn;
  telegramSettingsObj["botId"] = settings.telegramSettings.botId;
  telegramSettingsObj["lastMessage"] = settings.telegramSettings.lastMessage;
  telegramSettingsObj["lastMessage"] = settings.telegramSettings.isPush;

  // Добавляем информацию о пользователях Telegram
  JsonArray usersArray = telegramSettingsObj.createNestedArray("telegramUsers");
  for (const auto& user : settings.telegramSettings.telegramUsers) {
    JsonObject userObj = usersArray.createNestedObject();
    userObj["id"] = user.id;
    userObj["reading"] = user.reading;
    userObj["writing"] = user.writing;
  }

