XPavel86/ESp32UniversalRele/Settings.h
  File file = SPIFFS.open("/settings.json", FILE_WRITE);

  delay(500);
  if (!file) {
    delay(400);
    SPIFFS.end();
    delay(400);

    if (!SPIFFS.begin(true)) {
      Serial.println("Failed to mount SPIFFS on retry");
      if (wdt) {
        // esp_task_wdt_reset();  // Сброс таймера WDT
        // esp_task_wdt_delete(NULL);
      }
      return false;
    }
  }

  serializeJson(doc, file);
  file.close();
  Serial.println("\nSettings saved");

  if (wdt) {
    // esp_task_wdt_reset();  // Сброс таймера WDT
    // esp_task_wdt_delete(NULL);
  }

  return true;
}

//==============================
bool loadSettings(bool wdt = false) {
  delay(500);

  if (!SPIFFS.begin(true)) {
    Serial.println("Failed to mount file system");
    return false;
  }

  File file = SPIFFS.open("/settings.json", "r");
  if (!file) {
    Serial.println("Failed to open file for reading");
    return false;
  }

  size_t size = file.size();
  std::unique_ptr<char[]> buf(new char[size]);
  file.readBytes(buf.get(), size);
  DynamicJsonDocument doc(4096);  // Увеличиваем размер документа
  DeserializationError error = deserializeJson(doc, buf.get());

  if (error) {
    Serial.println("Failed to parse settings file");
    initializeWiFiSettings(settings);

    return false;
  }

  // Чтение сетевых настроек
  settings.networkSettings.clear();
  JsonArray networkSettingsArray = doc["networkSettings"];
  for (JsonObject networkSetting : networkSettingsArray) {
    NetworkSetting network;
    network.ssid = networkSetting["ssid"].as<String>();
    network.password = networkSetting["password"].as<String>();
    network.useStaticIP = networkSetting["useStaticIP"].as<bool>();
    network.staticIP.fromString(networkSetting["staticIP"].as<String>());
    network.staticGateway.fromString(networkSetting["staticGateway"].as<String>());
    network.staticSubnet.fromString(networkSetting["staticSubnet"].as<String>());
    network.staticDNS.fromString(networkSetting["staticDNS"].as<String>());
    settings.networkSettings.push_back(network);
  }

  // Чтение остальных настроек
  settings.isWifiTurnedOn = doc["isWifiTurnedOn"].as<bool>();
  settings.currentIdNetworkSetting = doc["currentIdNetworkSetting"].as<int>();
  settings.ssidAP = doc["ssidAP"].as<String>();
  settings.passwordAP = doc["passwordAP"].as<String>();
  settings.ipAddressAP.fromString(doc["ipAddressAP"].as<String>());
  settings.isAP = doc["isAP"].as<bool>();

  JsonObject telegramSettingsObj = doc["telegramSettings"];
  settings.telegramSettings.isTelegramOn = telegramSettingsObj["isTelegramOn"].as<bool>();
  settings.telegramSettings.botId = telegramSettingsObj["botId"].as<String>();
  //settings.telegramSettings.lastMessage = telegramSettingsObj["lastMessage"].as<String>();
  settings.telegramSettings.lastMessage = telegramSettingsObj["lastMessage"].isNull() ? "" : telegramSettingsObj["lastMessage"].as<String>();
  settings.telegramSettings.isPush = telegramSettingsObj["isPush"].as<bool>();

  settings.telegramSettings.telegramUsers.clear();
  JsonArray usersArray = telegramSettingsObj["telegramUsers"];
  for (JsonObject user : usersArray) {
    TelegramUserID telegramUser;
    telegramUser.id = user["id"].as<String>();
    telegramUser.reading = user["reading"].as<bool>();
    telegramUser.writing = user["writing"].as<bool>();
    settings.telegramSettings.telegramUsers.push_back(telegramUser);
  }

  file.close();

  idSetting = settings.currentIdNetworkSetting;

  return true;
}

//===========================
// Проверка, если свободной памяти меньше критического порога
void checkMemory() {
  if (esp_get_free_heap_size() < 1024) {
    String timestamp = getFormattedTimeFromRTC();

    String s = timestamp + "\n";
    s += "Critical memory level detected!\n";
    s += "Restarting due to critical memory level.\n";

    settings.telegramSettings.lastMessage = s;
    saveSettings();
    delay(1000);
    res = true;
  }
}

//=============================
bool wasAPMode = false;

struct NetworkInfo {
  String ssid;
  int rssi;
};

NetworkInfo* ssidList = nullptr;  // Объявление массива как глобальной переменной и инициализация его нулевым указателем

String scanNetworks(bool isState = true) {

  if (isUpdate) {
    return "[]";
  }

  isScan = true;

  // Сохранение начального состояния WiFi
  wasAPMode = WiFi.getMode() == WIFI_AP;

  int inc = 0;
  int numNetworks = 0;

  while (numNetworks <= 0 && inc < 5) {
    numNetworks = WiFi.scanNetworks();
    Serial.println("\nScan networks\n " + String(numNetworks));

    if (numNetworks > 0) {
      break;
    }

    if (inc >= 3) {
      WiFi.disconnect(true);
      delay(300);
      WiFi.mode(WIFI_OFF);
      delay(300);
      WiFi.mode(WIFI_STA);
      delay(500);
    }

    inc++;
    delay(1000);  // Ожидание перед следующей попыткой
  }

  if (numNetworks <= 0) {
    // Если после 3 попыток сети не найдены, присваиваем numNetworks = 0
    Serial.println("No networks found after 3 attempts.");
    return "[]";
  }

  // Выделение памяти под массив структур NetworkInfo
  ssidList = new NetworkInfo[numNetworks];

  // Сохранение информации о сетях в массив
  for (int i = 0; i < numNetworks; ++i) {
    ssidList[i].ssid = WiFi.SSID(i);
    ssidList[i].rssi = WiFi.RSSI(i);
  }

  // Сортировка массива по убыванию силы сигнала (RSSI)
  for (int i = 0; i < numNetworks - 1; ++i) {
    for (int j = i + 1; j < numNetworks; ++j) {
      if (ssidList[i].rssi < ssidList[j].rssi) {
        NetworkInfo temp = ssidList[i];
        ssidList[i] = ssidList[j];
        ssidList[j] = temp;
      }
    }
  }

  // Формируем JSON строку
  String result = "[";
  for (int i = 0; i < numNetworks; ++i) {
    if (i) result += ",";
    result += "{";
    result += "\"ssid\":\"" + ssidList[i].ssid + "\",";
    result += "\"rssi\":" + String(ssidList[i].rssi);
    result += "}";
  }
  result += "]";

  // Освобождение памяти, если массив уже был выделен
  if (ssidList != nullptr) {
    delete[] ssidList;
    ssidList = nullptr;
  }

