XPavel86/ESp32UniversalRele/Settings.h
  if (isState) {
    if (wasAPMode) {
      WiFi.mode(WIFI_AP);
    } else {
      WiFi.mode(WIFI_STA);
    }
  }

  isScan = false;
  Serial.println("\nStop scan networks\n");
  return result;
}


//=============================
void getTimeFromRTC() {
  dateTime.setMinute = rtc.getMinute();
  dateTime.setHour = rtc.getHour(true);
  dateTime.setDay = rtc.getDay();
  dateTime.setMonth = rtc.getMonth() + 1;
  dateTime.setYear = rtc.getYear();
}

void getNowDateTime() {
  // Задаем часовой пояс прямо в configTime
  configTime(3 * 3600, 0, "pool.ntp.org");  // UTC+3 для Москвы

  struct tm timeinfo;

  if (getLocalTime(&timeinfo)) {
    time_t now = time(nullptr);

    rtc.setTime(now);
    getTimeFromRTC();

    Serial.println("Time set in RTC: " + rtc.getTime("%A, %d %B %Y %H:%M:%S"));
  } else {
    Serial.println("Failed to obtain time");
  }
}

//================================
void setTimeManually(const String& date, const String& time) {
  // Проверяем длину строк
  if (date.length() != 10 || time.length() != 5) {
    Serial.println("Error: Invalid date or time format. Expected 'YYYY-MM-DD' and 'HH:MM'.");
    return;
  }

  // Разбор строки с датой
  int year = date.substring(0, 4).toInt();
  int month = date.substring(5, 7).toInt();
  int day = date.substring(8, 10).toInt();

  // Разбор строки с временем
  int hour = time.substring(0, 2).toInt();
  int minute = time.substring(3, 5).toInt();

  // Проверяем корректность данных
  if (year < 2000 || year > 9100 || month < 1 || month > 12 || day < 1 || day > 31 || hour < 0 || hour > 23 || minute < 0 || minute > 59) {
    Serial.println("Error: Invalid date or time values.");
    return;
  }

  // Создаем структуру tm для времени
  struct tm newTime = {};
  newTime.tm_year = year - 1900;  // В библиотеке tm год отсчитывается с 1900
  newTime.tm_mon = month - 1;     // Месяцы отсчитываются с 0
  newTime.tm_mday = day;
  newTime.tm_hour = hour;
  newTime.tm_min = minute;
  newTime.tm_sec = 0;  // Секунды можно установить в 0

  // Устанавливаем время в RTC
  time_t newEpoch = mktime(&newTime);  // Конвертируем структуру tm в time_t
  rtc.setTime(newEpoch);               // Устанавливаем время в RTC

  // Считываем и обновляем локальное время
  getTimeFromRTC();

  Serial.println("Manual time set in RTC: " + rtc.getTime("%A, %d %B %Y %H:%M:%S"));
}
//================================
void updateBotId() {

  //=========================================================
  if (settings.telegramSettings.botId != oldBotId) {

    if (bot != nullptr) {  // Проверка, что bot инициализирован
      bot->updateToken(settings.telegramSettings.botId);
      isBotToken = true;
    } else {
      Serial.println("Error: bot is not initialized.");
    }

    oldBotId = settings.telegramSettings.botId;  // Обновление старого значения botId
  }
}

//================================
void bot_setup() {

  const String commands = F("["
                            "{\"command\":\"status\",  \"description\":\"Текущий статус устройства\"},"
                            "{\"command\":\"reset\",  \"description\":\"Перезагрузить устойство\"},"
                            "{\"command\":\"update\",  \"description\":\"Обновить прошивку или файлы\"},"
                            "{\"command\":\"newtoken\",  \"description\":\"Установить новый бот токен\"}"
                            "]");
  botSetCommands(settings.telegramSettings.botId, commands);
  //bot->setMyCommands(commands);
}

//===============================

void startTelegramMessage() {
#ifdef ESP32
  client.setCACert(TELEGRAM_CERTIFICATE_ROOT);
  isCertificate = true;
#endif

#ifdef ESP8266
  configTime(0, 0, "pool.ntp.org");
  client.setTrustAnchors(&cert);
  isCertificate = true;
#endif

  Serial.print("BOT Send\n");

  for (const auto& user : settings.telegramSettings.telegramUsers) {
    if (!user.id.isEmpty() && user.reading && isBotToken && settings.telegramSettings.isTelegramOn) {

      String sendStr = "Hello\n";
      sendStr += "Доступ из локальной сети: http://" + WiFi.localIP().toString() + "\n";
      sendStr += "Подключено: " + WiFi.SSID() + "\n";

      sendStr += settings.telegramSettings.lastMessage;

      int messageSent = bot->sendMessage(user.id, sendStr, "");

      if (settings.telegramSettings.lastMessage.length() > 1) {
        settings.telegramSettings.lastMessage = "";
        saveSettings();
      }

      //deleteBotCommands(settings.telegramSettings.botId);

      bot_setup();

      if (messageSent == 1) {
        isCertificate = true;
        Serial.print("\nBotCode: " + String(messageSent) + "\n");

        return;
      } else {
        isCertificate = false;
        Serial.print("\nBotCode: " + String(messageSent) + "\n");
      }
    }
  }
}

//=====================

bool checkInternetConnection() {
  WiFiClient client;
  const char* urlList[] = { "api.telegram.org", "nc.ru" };
  int arraySize = sizeof(urlList) / sizeof(urlList[0]);

  if (isConnectedWiFi && !isStartedAP && !isUpdate) {
    for (int i = 0; i < arraySize; ++i) {
      Serial.print("Attemp connecting to: " + String(urlList[i]) + "\n");
      if (client.connect(urlList[i], 443)) {
        delay(300);  // Добавлено для устойчивости соединения
        isInternetConnected = true;
        Serial.print("\nInternet is connected\n");
        getNowDateTime();

        updateBotId();

        return true;
      }
    }
  }
  // Если не удалось установить соединение ни с одним из хостов
  Serial.print("\nNo internet connection\n");
  isInternetConnected = false;
  getTimeFromRTC();
  return false;
}

//======================================================================

int getTotalNetworks() {
  int count = 0;
  for (const auto& network : settings.networkSettings) {
    if (!network.ssid.isEmpty()) {
      count++;
    }
  }
  return count;
}

// Обновленная функция для подключения к Wi-Fi
bool connectToWiFi(const char* ssid, const char* password, int idSetting) {

  WiFi.mode(WIFI_STA);
  delay(100);

  if (settings.networkSettings[idSetting].useStaticIP) {
    WiFi.config(
      settings.networkSettings[idSetting].staticIP,
      settings.networkSettings[idSetting].staticGateway,
      settings.networkSettings[idSetting].staticSubnet,
      settings.networkSettings[idSetting].staticDNS);
  }

  WiFi.begin(ssid, password);
  Serial.println("Begin status WIFI: " + String(WiFi.status()));
  //unsigned long startTime = millis();
  int attempts = 0;
  const int maxAttempts = 10;
  const unsigned long connectionTimeout = 8000;

  Serial.print("Connect to: " + String(ssid) + " Index network: " + String(idSetting));
  while (WiFi.status() != WL_CONNECTED && attempts < maxAttempts) {
    delay(1000);
    Serial.print(".");
    attempts++;
    // Serial.println(ESP.getFreeHeap() / 1024);
    if (attempts > 6) {
      WiFi.disconnect();
      Serial.println("\nFailed to connect");
      isConnectedWiFi = false;
      return false;
    }
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nConnected to " + String(ssid));
    IPAddress IP = WiFi.localIP();
    Serial.print("IP address: ");
    Serial.println(IP);

    isConnectedWiFi = true;
    isStartedAP = false;

    //analogWrite(ledPin, 255);  // Полная яркость

