XPavel86/ESp32UniversalRele/Settings.h
    // Проверка подключения к интернету и отправка сообщений
    checkInternetConnection();
    if (isInternetConnected && !isCertificate) {
      startTelegramMessage();
    }

    if (!settings.networkSettings[idSetting].useStaticIP) {
      settings.networkSettings[idSetting].staticIP = WiFi.localIP();
      settings.networkSettings[idSetting].staticGateway = WiFi.gatewayIP();
      settings.networkSettings[idSetting].staticSubnet = WiFi.subnetMask();
      settings.networkSettings[idSetting].staticDNS = WiFi.dnsIP();
    }

    return true;
  }
  Serial.println("\nFailed to connect end");
}

//===============================================================

String startAccessPoint(const char* ssid = nullptr, const char* password = nullptr, const char* ipAddress = nullptr) {

  // Проверяем параметры на наличие и устанавливаем дефолтные значения при необходимости
  ssid = ssid ? ssid : defaultSsidAP;
  password = password ? password : defaultPasswordAP;
  ipAddress = ipAddress ? ipAddress : local_IP.toString().c_str();

  // Запускаем точку доступа
  if (password && *password) {
    WiFi.softAP(ssid, password);
  } else {
    WiFi.softAP(ssid);
  }
  WiFi.softAPConfig(local_IP, gateway, subnet);

  // Получаем IP-адрес точки доступа
  IPAddress IP = WiFi.softAPIP();
  String ipStr = IP.toString();

  // Проверяем, что IP-адрес доступен
  if (IP != IPAddress(0, 0, 0, 0)) {
    Serial.println("Access Point IP: " + ipStr);
    isStartedAP = true;
    isConnectedWiFi = false;
    //analogWrite(ledPin, 100);  // Половина яркости
    return "Access Point set to SSID: " + String(ssid) + " with IP: " + ipStr;

  } else {
    Serial.println("Failed to start Access Point");
    isStartedAP = false;
    //analogWrite(ledPin, 50);  // Половина яркости
    return "Failed to start Access Point";
  }
}
//===============================================================

bool connectToBestAvailableNetwork() {
  Serial.println("connectToBestAvailableNetwork");
  bool connected = false;
  int networksFound = 0;

  String networksJson = scanNetworks(true);  // Отсканируем доступные сети

  if (networksJson.length() < 3) {
    isConnectionAttempts = false;
    return false;
  }

  const size_t capacity = JSON_ARRAY_SIZE(20) + 20 * JSON_OBJECT_SIZE(2) + 1024;
  DynamicJsonDocument doc(capacity);

  DeserializationError error = deserializeJson(doc, networksJson);
  if (error) {
    Serial.println("Failed to parse JSON");

    connected = false;
    isConnectionAttempts = false;
  }

  if (!error) {
    JsonArray networks = doc.as<JsonArray>();
    networksFound = networks.size();  // Получаем количество найденных сетей
    Serial.println(networksJson);
    //Serial.println(networksFound);

    int i = 0;

    while (!connected && i < networksFound) {
      JsonObject network = networks[i];
      String ssid = network["ssid"].as<String>();

      int networks = getTotalNetworks();
      totalNetworks = networks;
      // Перебираем настройки сети и пытаемся подключиться
      for (int j = 0; j < networks; ++j) {
        if (ssid == settings.networkSettings[j].ssid) {
          Serial.println("Trying to connect to saved network: " + ssid);
          bool result = connectToWiFi(ssid.c_str(), settings.networkSettings[j].password.c_str(), j);

          if (WiFi.status() == WL_CONNECTED) {
            settings.currentIdNetworkSetting = j;
            //saveSettings();
            connected = true;
            return result;  // Успешно подключились
          } else {
            Serial.println("Failed to connect to " + ssid);
          }
        }
      }

      i++;
    }
  }

  // Если все сети проверены и не удалось подключиться
  if (!connected) {
    isConnectionAttempts = false;
    Serial.println("Failed to connect to any saved network, switching to AP Mode");
    startAccessPoint(settings.ssidAP.c_str(), settings.passwordAP.c_str(), settings.ipAddressAP.toString().c_str());
  }

  return false;
}

//==================================

void sendInitialMenu() {
  for (const auto& user : settings.telegramSettings.telegramUsers) {
    if (!user.id.isEmpty() && user.reading && isBotToken && settings.telegramSettings.isTelegramOn) {
      String sendStr = "Telegram bot is ready!\n";
      // sendStr += "Доступ из локальной сети: http://" + WiFi.localIP().toString() + "\n";
      // sendStr += "Подключено: "+ WiFi.SSID() + "\n";

      int messageSent = bot->sendMessage(user.id, sendStr, "");
    }
  }
}
//======================================

void changeBotId(String newToken) {
  isBotToken = false;
  delay(0);
  if (newToken.length() > 20) {
    // Освобождаем память, занятую текущим объектом бота
    if (bot != nullptr) {
      delete bot;
      bot = nullptr;
    }

    // Создаем новый объект бота с новым токеном
    bot = new UniversalTelegramBot(newToken, client);
    Serial.println("\nBot token changed");

    //      if (isInternetConnected) {
    //      bool responseCode = bot->getMe();
    //
    //      if (!responseCode) {
    //        Serial.println("Error: Unable to connect to Telegram server");
    //        Serial.print("Response code: ");
    //        Serial.println(responseCode);
    //
    //      } else {
    //        isBotToken = true;
    //        Serial.println("Successfully connected to Telegram server");
    //        sendInitialMenu();
    //      }
    //     }

    isBotToken = true;

    Serial.print("New Bot Token: ");
    Serial.println(newToken);
    Serial.println("\nBot initialized");


  } else {
    Serial.println("New token is empty. Token not changed.");
    isBotToken = false;
  }
}

//=================================
void deleteNetwork(String ssid) {
  auto it = std::find_if(settings.networkSettings.begin(), settings.networkSettings.end(),
                         [&ssid](const NetworkSetting& network) {
                           return network.ssid == ssid;
                         });

  if (it != settings.networkSettings.end()) {
    settings.networkSettings.erase(it);

    // Обновление текущего индекса сети
    if (settings.networkSettings.empty()) {
      settings.currentIdNetworkSetting = -1;  // Сброс текущего индекса, если нет ни одной сети
    } else {
      int index = std::distance(settings.networkSettings.begin(), it);
      if (settings.currentIdNetworkSetting == index) {
        settings.currentIdNetworkSetting = 0;  // Если удаляемый элемент был текущим выбранным, устанавливаем на первый элемент
      } else if (settings.currentIdNetworkSetting > index) {
        settings.currentIdNetworkSetting--;  // Если текущий выбранный элемент находится после удаленного, смещаем индекс на один назад
      }
    }
  }
}

//================================= r.manualMode = true;r.manualMode = true;

void serverProcessingControl() {

