XPavel86/ESp32UniversalRele/Settings.h
  // Настроим сервер для обработки GET-запросов
  server.on("/getFormScenario", HTTP_GET, [](AsyncWebServerRequest* request) {
    // Создание JSON документа
    DynamicJsonDocument doc(2048);

    // Добавляем данные из структуры Scenario
    doc["useSetting"] = control.scenario.useSetting;
    doc["setTemperature"] = control.scenario.temperature;
    doc["temperatureCheckbox"] = control.scenario.temperatureCheckbox;
    doc["startDate"] = control.scenario.startDate;
    doc["startTime"] = control.scenario.startTime;
    doc["endDate"] = control.scenario.endDate;
    doc["endTime"] = control.scenario.endTime;
    doc["pinRelays"] = control.scenario.pinRelays;
    doc["pinRelays2"] = control.scenario.pinRelays2;

    doc["timeInterval"] = control.scenario.timeInterval;

    // Добавляем данные о днях недели
    JsonArray week = doc.createNestedArray("week");
    for (int i = 0; i < 7; i++) {
      week.add(control.scenario.week[i]);
    }

    // Сериализация JSON документа в строку
    String response;
    serializeJson(doc, response);

    // Отправляем данные на клиент
    request->send(200, "application/json", response);
  });

  server.on("/formScenario", HTTP_POST, [](AsyncWebServerRequest* request) {
    printRequestParameters(request);

    // Проверка на наличие обязательных параметров
    if (!request->hasParam("useSetting", true)) {
      request->send(400, "text/plain", "Missing parameters");
      return;
    }

    // Обработка параметров
    if (request->hasParam("useSetting", true)) {
      control.scenario.useSetting = request->getParam("useSetting", true)->value() == "true";
    }

    if (request->hasParam("setTemperature", true)) {
      control.scenario.temperature = request->getParam("setTemperature", true)->value().toInt();
    }

    if (request->hasParam("temperatureCheckbox", true)) {
      control.scenario.temperatureCheckbox = request->getParam("temperatureCheckbox", true)->value() == "true";
    }

    if (request->hasParam("startDate", true)) {
      control.scenario.startDate = request->getParam("startDate", true)->value();
    }

    if (request->hasParam("startTime", true)) {
      control.scenario.startTime = request->getParam("startTime", true)->value();
    }

    if (request->hasParam("endDate", true)) {
      control.scenario.endDate = request->getParam("endDate", true)->value();
    }

    if (request->hasParam("endTime", true)) {
      control.scenario.endTime = request->getParam("endTime", true)->value();
    }

    if (request->hasParam("pinRelays", true)) {
      control.scenario.pinRelays = request->getParam("pinRelays", true)->value().toInt();
    }

    if (request->hasParam("pinRelays2", true)) {
      control.scenario.pinRelays2 = request->getParam("pinRelays2", true)->value().toInt();
    }

    if (request->hasParam("timeInterval", true)) {
      control.scenario.timeInterval = request->getParam("timeInterval", true)->value().toInt();
    }

    // Обработка дней недели
    if (request->hasParam("week", true)) {
      String weekString = request->getParam("week", true)->value();
      DynamicJsonDocument doc(1024);  // Создаем документ для парсинга JSON
      DeserializationError error = deserializeJson(doc, weekString);

      if (error) {
        Serial.println("Ошибка при парсинге JSON для недели");
        request->send(400, "text/plain", "Invalid week data format");
        return;
      }

      // Присваиваем значения дням недели из JSON
      control.scenario.week[0] = doc["monday"].as<bool>();
      control.scenario.week[1] = doc["tuesday"].as<bool>();
      control.scenario.week[2] = doc["wednesday"].as<bool>();
      control.scenario.week[3] = doc["thursday"].as<bool>();
      control.scenario.week[4] = doc["friday"].as<bool>();
      control.scenario.week[5] = doc["saturday"].as<bool>();
      control.scenario.week[6] = doc["sunday"].as<bool>();
    }

    // Печать состояния после обновления
    Serial.println("OK");
    Serial.printf("Save /formScenario: UseSetting=%d, Temperature=%d, TemperatureCheckbox=%d, StartDate=%s, StartTime=%s, EndDate=%s, EndTime=%s, PinRelays=%d, PinRelays2=%d, timeInterval=%d,  Week=[",
                  static_cast<int>(control.scenario.useSetting),           // bool -> int
                  control.scenario.temperature,                            // int
                  static_cast<int>(control.scenario.temperatureCheckbox),  // bool -> int
                  control.scenario.startDate.c_str(),                      // String -> const char*
                  control.scenario.startTime.c_str(),                      // String -> const char*
                  control.scenario.endDate.c_str(),                        // String -> const char*
                  control.scenario.endTime.c_str(),                        // String -> const char*
                  control.scenario.pinRelays,
                  control.scenario.pinRelays2,
                  control.scenario.timeInterval  // int
    );

    // Добавляем вывод дней недели
    for (int i = 0; i < 7; i++) {
      Serial.printf("%s=%d", (i == 0 ? "Monday" : (i == 1 ? "Tuesday" : (i == 2 ? "Wednesday" : (i == 3 ? "Thursday" : (i == 4 ? "Friday" : (i == 5 ? "Saturday" : "Sunday")))))),
                    control.scenario.week[i]);
      if (i < 6) {
        Serial.print(", ");
      }
    }
    Serial.println("]");

    // Ответ клиенту
    request->send(200, "application/json", "{\"status\":\"Success\"}");
  });

  server.on("/relay", HTTP_POST, [](AsyncWebServerRequest* request) {
    // Проверяем наличие параметров
    if (!request->hasParam("relay", true) || !request->hasParam("action", true)) {
      request->send(400, "text/plain", "Missing parameters");
      return;
    }

    // Извлечение параметров
    String relay = request->getParam("relay", true)->value();
    String action = request->getParam("action", true)->value();

    Serial.printf("Received Relay: %s, Action: %s\n", relay.c_str(), action.c_str());

    bool relayFound = false;

    for (auto& r : control.relays) {
      if (r.description == relay) {
        relayFound = true;
        r.statePin = (action == "on");

        Serial.printf("Setting Relay Pin %d to %s\n", r.pin, r.statePin ? "HIGH" : "LOW");
        r.manualMode = true;
        digitalWrite(r.pin, r.statePin ? HIGH : LOW);
        isSaveControl = true;
        request->send(200, "text/plain", "Command executed");
        break;
      }
    }

    if (!relayFound) {
      request->send(404, "text/plain", "Relay not found");
    }
  });

  server.on("/resetManual", HTTP_POST, [](AsyncWebServerRequest* request) {
    Serial.println("Resetting all relays to Auto mode");

