XPavel86/ESp32UniversalRele/Settings.h
    // Создаем объект реле
    Relay relay;
    relay.pin = pin.toInt();
    relay.modePin = modePin;
    relay.manualMode = (manualMode == "on");
    relay.statePin = (statePin == "true");
    relay.description = description;

    // Добавляем реле в список
    control.relays.push_back(relay);

    // Логируем информацию о добавленном реле
    Serial.printf("New relay added: Pin=%d, Mode=%s, ManualMode=%d, StatePin=%d, Description=%s\n",
                  relay.pin, relay.modePin, relay.manualMode, relay.statePin, relay.description.c_str());

    // Отправляем успешный ответ
    request->send(200, "application/json", "{\"status\":\"Success\"}");
  });
}
//========================================


void serverProcessing() {
  //if (isConnectedWiFi || isStartedAP) {
  Serial.println("serverProcessing");

  // Настройка маршрутов для загрузки HTML страницы из SPIFFS
  // Настройка сервера
  server.on("/", HTTP_GET, handleRoot);

  //=======================

  // Обработчик POST-запроса для утановки даты и времени
  server.on("/setDateTime", HTTP_POST, [](AsyncWebServerRequest* request) {
    printRequestParameters(request);

    if (request->hasParam("date", true) && request->hasParam("time", true)) {
      // Получаем параметры из тела запроса (через FormData)
      String dateS = request->getParam("date", true)->value();
      String timeS = request->getParam("time", true)->value();

      // Проверяем, что дата и время присутствуют
      if (dateS.isEmpty() || timeS.isEmpty()) {
        request->send(400, "application/json", "{\"message\":\"Date and time are required\"}");
        return;
      }

      // Устанавливаем дату и время вручную
      setTimeManually(dateS, timeS);

      // Возвращаем успешный ответ
      request->send(200, "application/json", "{\"message\":\"Date and time successfully updated\"}");
      Serial.println("Date and time updated to: " + dateS + " " + timeS);
    } else {
      // Если не найдены параметры date или time
      request->send(400, "application/json", "{\"message\":\"Date and time are required\"}");
    }
  });


  // Обработчик для получения списка файлов
  server.on("/fileList", HTTP_GET, [](AsyncWebServerRequest* request) {
    File root = SPIFFS.open("/");
    if (!root || !root.isDirectory()) {
      request->send(500, "application/json", "{\"error\":\"Failed to access SPIFFS\"}");
      return;
    }

    String fileList = "[";
    File file = root.openNextFile();
    while (file) {
      if (fileList.length() > 1) {
        fileList += ",";
      }
      fileList += "\"" + String(file.name()) + "\"";
      file.close();
      file = root.openNextFile();
    }
    fileList += "]";
    request->send(200, "application/json", fileList);
  });

  // Обработчик для скачивания конкретного файла
  server.on("/downloadFile", HTTP_GET, [](AsyncWebServerRequest* request) {
    if (!request->hasParam("filename")) {
      request->send(400, "text/plain", "Missing 'filename' parameter");
      return;
    }

    String filename = request->getParam("filename")->value();
    if (!SPIFFS.exists(filename)) {
      request->send(404, "text/plain", "File not found");
      return;
    }

    AsyncWebServerResponse* response = request->beginResponse(SPIFFS, filename, "application/octet-stream");
    response->addHeader("Content-Disposition", "attachment; filename=\"" + filename + "\"");
    request->send(response);
  });
  // Обработчик для получения настроек
  server.on("/getsettings", HTTP_GET, [](AsyncWebServerRequest* request) {
    String json = getSettingsJson();
    request->send(200, "application/json", json);
  });

  server.on("/scan", HTTP_POST, [](AsyncWebServerRequest* request) {
    if (!isScan) {
      isBotToken = false;
      isScan = true;
      request->send(200, "application/json", "{\"success\":true,\"message\":\"Scan started\"}");
    } else {
      request->send(400, "application/json", "{\"success\":false,\"message\":\"Scan already in progress\"}");
    }
    isBotToken = true;
  });

  server.on("/getNetworks", HTTP_GET, [](AsyncWebServerRequest* request) {
    if (isScan) {
      request->send(200, "application/json", "[]");
      Serial.println(scannedNetworks);
    } else {
      request->send(200, "application/json", scannedNetworks);
    }
  });

  server.on("/applySettings", HTTP_POST, [](AsyncWebServerRequest* request) {
    String mode = request->getParam("mode", true)->value();
    bool isAP = request->hasParam("is_ap", true);  // Проверка наличия параметра is_ap

    if (mode == "client") {
      settings.isAP = false;
      //settings.ssidAP = ""; // Очищаем поле SSID точки доступа

      if (request->hasParam("ssid", true) && request->hasParam("password", true) && request->hasParam("ip_mode", true)) {
        String newSSID = request->getParam("ssid", true)->value();
        String newPassword = request->getParam("password", true)->value();
        String ipMode = request->getParam("ip_mode", true)->value();
        int selectedNetworkIndex = -1;

        // Проверяем, существует ли уже SSID в векторе
        for (size_t i = 0; i < settings.networkSettings.size(); ++i) {
          if (settings.networkSettings[i].ssid == newSSID) {
            selectedNetworkIndex = i;
            break;
          }
        }

        // Если SSID не найден, добавляем новый элемент в вектор
        if (selectedNetworkIndex == -1) {
          // Добавляем новый элемент в вектор
          settings.networkSettings.push_back(NetworkSetting());
          selectedNetworkIndex = settings.networkSettings.size() - 1;

          // Инициализируем новый элемент
          settings.networkSettings[selectedNetworkIndex].ssid = newSSID;
          settings.networkSettings[selectedNetworkIndex].password = newPassword;
        } else {
          // Обновляем существующую сеть
          settings.networkSettings[selectedNetworkIndex].password = newPassword;
        }

        NetworkSetting& selectedNetwork = settings.networkSettings[selectedNetworkIndex];

        if (ipMode == "static") {
          selectedNetwork.useStaticIP = true;
          selectedNetwork.staticIP.fromString(request->getParam("static_ip", true)->value());
          selectedNetwork.staticGateway.fromString(request->getParam("gateway", true)->value());
          selectedNetwork.staticSubnet.fromString(request->getParam("subnet", true)->value());
          selectedNetwork.staticDNS.fromString(request->getParam("dns", true)->value());
        } else {
          selectedNetwork.useStaticIP = false;
        }

        settings.currentIdNetworkSetting = selectedNetworkIndex;  // Устанавливаем текущий ID сети
        settings.isWifiTurnedOn = true;                           // Предполагаем, что Wi-Fi включен после настройки
      }
    } else if (mode == "is_ap" && isAP) {
      settings.isAP = true;
      settings.ssidAP = request->getParam("ap_ssid", true)->value();

