XPavel86/ESp32UniversalRele/Settings.h
      if (request->hasParam("ap_password", true)) {
        settings.passwordAP = request->getParam("ap_password", true)->value();
      }

      settings.ipAddressAP.fromString(request->getParam("ap_ip", true)->value());
      settings.isWifiTurnedOn = true;  // Предполагаем, что Wi-Fi включен после настройки
    }

    // Обработка настроек Telegram
    if (request->hasParam("botId", true)) {
      String botId = request->getParam("botId", true)->value();
      settings.telegramSettings.botId = botId;

      updateBotId();

      String isTelegramOnStr = request->getParam("isTelegramOn", true)->value();
      settings.telegramSettings.isTelegramOn = (isTelegramOnStr == "true");

      // Очищаем текущий список пользователей
      settings.telegramSettings.telegramUsers.clear();

      int userIndex = 0;
      if (request->hasParam("users", true)) {
        String usersParam = request->getParam("users", true)->value();
        DynamicJsonDocument doc(2048);
        DeserializationError error = deserializeJson(doc, usersParam);

        if (error) {
          Serial.print(F("deserializeJson() failed: "));
          Serial.println(error.c_str());
          request->send(400, "application/json", "{\"success\":false,\"message\":\"Invalid JSON\"}");
          return;
        }

        JsonArray usersArray = doc.as<JsonArray>();

        for (JsonObject userObj : usersArray) {
          if (userIndex < settings.telegramSettings.telegramUsers.capacity()) {
            settings.telegramSettings.telegramUsers.push_back({ userObj["id"].as<String>(),
                                                                userObj["reading"].as<bool>(),
                                                                userObj["writing"].as<bool>() });
            userIndex++;
          }
        }
      }
    }

    bool isResult = saveSettings();

    isSaveControl = true;


    if (isResult) {
      request->send(200, "application/json", "{\"success\":true,\"message\":\"Settings applied successfully\"}");
    } else {
      request->send(500, "application/json", "{\"success\":false,\"message\":\"Failed to apply settings\"}");
    }
  });

  server.on("/deleteNetwork", HTTP_POST, [](AsyncWebServerRequest* request) {
    printRequestParameters(request);
    if (request->hasParam("ssid", true)) {
      String ssid = request->getParam("ssid", true)->value();

      deleteNetwork(ssid);

      // Отправляем успешный ответ клиенту
      request->send(200, "application/json", "{\"success\":true,\"message\":\"Network deleted successfully\"}");
    } else {
      // Отправляем ошибку клиенту, если параметр "ssid" отсутствует в запросе
      request->send(400, "application/json", "{\"success\":false,\"message\":\"SSID parameter is missing\"}");
    }
  });

  //========== Загрузка файла =========
  server.on(
    "/uploadFile", HTTP_POST, [](AsyncWebServerRequest* request) {
      // Обработчик для отправки ответа после загрузки
      request->send(200, "text/plain", "File Uploaded Successfully");
    },
    [](AsyncWebServerRequest* request, String filename, size_t index, uint8_t* fileData, size_t len, bool final) {
      handleFileUpload(request, filename, index, fileData, len, final);
    });

  //=============Рестарт===============
  // Обработчик для перезагрузки устройства
  server.on("/restart", HTTP_POST, [](AsyncWebServerRequest* request) {
    request->send(200, "application/json", "{\"message\":\"Устройство перезагружается...\"}");
    // Задержка перед перезагрузкой, чтобы клиент получил ответ
    delay(500);
    ESP.restart();
  });

  server.on("/format", HTTP_POST, [](AsyncWebServerRequest* request) {
    request->send(200, "application/json", "{\"message\":\"Устройство форматируется...\"}");
    // Задержка перед перезагрузкой, чтобы клиент получил ответ
    delay(500);
    SPIFFS.format();
    request->send(200, "application/json", "{\"success\":true,\"message\":\"Formated successfully\"}");
    delay(500);
    ESP.restart();
  });

  // Настройка сервера для изменения botId
  server.on("/set_bot_id", HTTP_POST, [](AsyncWebServerRequest* request) {
    if (request->hasParam("botId", true)) {
      String newBotId = request->getParam("botId", true)->value();
      settings.telegramSettings.botId = newBotId;

      Serial.println(newBotId);

      String botName = "";
      if (isInternetConnected) {
        botName = checkNewToken(newBotId);
      }

      updateBotId();

      // Отправляем ответ с именем бота
      String response = "{\"success\":true,\"message\":\"Bot ID applied successfully\", \"botName\":\"" + botName + "\"}";
      request->send(200, "application/json", response);
    } else {
      request->send(400, "application/json", "{\"message\":\"Invalid request\"}");
    }
  });

  // Обработчик для добавления пользователя
  server.on("/add_user", HTTP_POST, [](AsyncWebServerRequest* request) {
    if (request->hasParam("user_id", true) && request->hasParam("reading", true) && request->hasParam("writing", true)) {
      String userId = request->getParam("user_id", true)->value();
      bool reading = request->getParam("reading", true)->value() == "true";
      bool writing = request->getParam("writing", true)->value() == "true";

      // Добавляем нового пользователя в вектор
      settings.telegramSettings.telegramUsers.push_back({ userId, reading, writing });

      request->send(200, "application/json", "{\"success\":true,\"message\":\"User added successfully\"}");
    } else {
      request->send(400, "application/json", "{\"success\":false,\"message\":\"Required parameters missing\"}");
    }
  });


  server.on("/sysStatus", HTTP_GET, [](AsyncWebServerRequest* request) {
    String status = getSystemStatus();
    request->send(200, "text/plain", status);
  });

  // Обработчик для удаления пользователя
  server.on("/delete_user", HTTP_POST, [](AsyncWebServerRequest* request) {
    if (request->hasParam("user_id", true)) {
      String userId = request->getParam("user_id", true)->value();
      auto& users = settings.telegramSettings.telegramUsers;

      // Ищем пользователя по userId
      auto it = std::find_if(users.begin(), users.end(), [&](const auto& user) {
        return user.id == userId;
      });

