XPavel86/ESp32UniversalRele/Settings.h
      if (it != users.end()) {
        // Удаляем пользователя из вектора
        users.erase(it);
        request->send(200, "application/json", "{\"success\":true,\"message\":\"User deleted successfully\"}");
      } else {
        request->send(404, "application/json", "{\"message\":\"User not found\"}");
      }
      Serial.println(userId);

    } else {
      request->send(400, "application/json", "{\"message\":\"Invalid request\"}");
    }
  });

  server.begin();
}

//===================================
String parseNetworkSettings(const WiFiSettings& settings) {
  String result;
  for (const NetworkSetting& netSetting : settings.networkSettings) {
    if (!netSetting.ssid.isEmpty()) {
      result += "SSID: " + netSetting.ssid + "\n";
      result += "Password: " + netSetting.password + "\n";
      result += "DHCP: " + String(netSetting.useStaticIP ? "FALSE" : "TRUE") + "\n";
      result += "Static IP: " + netSetting.staticIP.toString() + "\n";
      result += "Static Gateway: " + netSetting.staticGateway.toString() + "\n";
      result += "Static Subnet: " + netSetting.staticSubnet.toString() + "\n";
      result += "Static DNS: " + netSetting.staticDNS.toString() + "\n";
      result += "\n";
    }
  }
  return result;
}

//================================
// Функция для поиска пользователя по его идентификатору
const TelegramUserID* getUserById(const String& userId) {
  for (const auto& user : settings.telegramSettings.telegramUsers) {
    if (user.id == userId) {
      return &user;
    }
  }
  return nullptr;  // Пользователь не найден
}
//==================================

void updateStatus() {
  if (previousStatus != statusUpdate) {
    bot->sendMessage(CHAT_ID, statusUpdate, "");
    previousStatus = statusUpdate;
  }
}

//==================================
void sendMessageWithMarkdown(String chat_id, String message) {
  // Создаем JSON-объект
  DynamicJsonDocument doc(1024);
  JsonObject payload = doc.to<JsonObject>();

  // Заполняем JSON-объект
  payload["chat_id"] = chat_id;
  payload["text"] = message;
  payload["disable_web_page_preview"] = true;  // Отключаем предварительный просмотр
  payload["parse_mode"] = "Markdown";          // Указываем использование Markdown "HTML"

  // Отправляем сообщение
  bool result = bot->sendPostMessage(payload, false);  // false означает, что не требуется редактирование сообщения
}

//==================================

bool isValidTokenFormat(const String& token) {
  int colonIndex = token.indexOf(':');

  if (colonIndex == -1 || colonIndex == 0 || colonIndex == token.length() - 1) {
    return false;
  }

  String userIdPart = token.substring(0, colonIndex);
  for (int i = 0; i < userIdPart.length(); i++) {
    if (!isDigit(userIdPart[i])) {
      return false;
    }
  }

  String secretPart = token.substring(colonIndex + 1);
  if (secretPart.length() < 20) {
    return false;
  }

  return true;
}

//==================================

File sendFileToTg;

bool isMoreDataAvailable() {
  return sendFileToTg.available();
}

byte getNextByte() {
  return sendFileToTg.read();
}


//================================
bool handleTelegramCommand(String chat_id, String command) {
  command.trim();  // Удалить лишние пробелы в начале и конце строки

  // Проверка и обработка команды "/on" и "/off"
  if (command.startsWith("/on") || command.startsWith("/off")) {
    bool turnOn = command.startsWith("/on");
    int relayNumber = command.substring(turnOn ? 3 : 4).toInt();  // Извлечь номер реле

    // Проверка, что relayNumber в диапазоне 1-4
    if (relayNumber >= 1 && relayNumber <= control.relays.size()) {
      int relayIndex = relayNumber - 1;
      auto& r = control.relays[relayIndex];
      r.statePin = turnOn;
      r.manualMode = true;
      digitalWrite(r.pin, turnOn ? HIGH : LOW);
      Serial.printf("Relay %d turned %s\n", r.pin, turnOn ? "ON" : "OFF");
      isSaveControl = true;  // Сохраняем состояние после изменения
      return true;
    } else {
      Serial.println("Invalid relay number");
      bot->sendMessage(chat_id, "Invalid relay number", "");
      return false;
    }
  }
  // Проверка команды ""
  else if (command == "/pushOff") {
    settings.telegramSettings.isPush = false;
    isSaveControl = true;
    String sOut = "Уведомления отключены";
    bot->sendMessage(chat_id, sOut, "");
    return true;
  }

  else if (command == "/pushOn") {
    settings.telegramSettings.isPush = true;
    isSaveControl = true;
    String sOut = "Уведомления включены";
    bot->sendMessage(chat_id, sOut, "");
    return true;
  }

  // Проверка команды "/statusControl"
  else if (command == "/status") {
    String sOut = sendStatus();
    bot->sendMessage(chat_id, sOut, "");
    return true;
  }

  // Проверка команды "/resetManual"
  else if (command == "/resetManual") {
    String sOut;
    bool anyRelayUpdated;

    for (auto& r : control.relays) {
      if (r.manualMode) {
        r.manualMode = false;  // Устанавливаем режим в Auto
        r.statePin = false;
        digitalWrite(r.pin, LOW);
        anyRelayUpdated = true;

        sOut += r.description + String(" set to Auto mode\n");
      }
    }
    if (anyRelayUpdated) {
      isSaveControl = true;  // Сохраняем состояние после изменения

      bot->sendMessage(chat_id, sOut, "");
      Serial.print(sOut);
    }
    return true;
  }  //====================================================
  // Проверка и обработка команды "/"
  else if (command.startsWith("/setTimeInterval")) {
    int value = command.substring(17).toInt();  // Извлечь значение
    control.scenario.timeInterval = value;
    Serial.printf("setTimeInterval set to %d\n", value);
    isSaveControl = true;
    return true;
  } else if (command.startsWith("/startTime")) {
    control.scenario.useSetting = true;
    isSaveControl = true;
    return true;
  }
  // Проверка и обработка команды "/setTime"
  else if (command.startsWith("/setTime")) {
    isSetTimeStart = true;
    isSetTimeEnd = false;

    String sOut = "Введите начальную дату и врмя в формате: " + rtc.getTime("%d.%m.%Y %H:%M");
    bot->sendMessage(chat_id, sOut, "");

