XPavel86/ESp32UniversalRele/Settings.h
    return true;

  } else if (isSetTimeStart && !command.isEmpty() && !command.startsWith("/stopTime")) {
    bool isValidStart = isValidDateTime(command);

    if (isValidStart) {

      isSetTimeStart = false;
      isSetTimeEnd = true;

      std::pair<String, String> result = splitDateTime(command);

      control.scenario.startDate = result.first;
      control.scenario.startTime = result.second;

      String sOut = "Введите конечную дату и врмя в формате: " + rtc.getTime("%d.%m.%Y %H:%M");
      bot->sendMessage(chat_id, sOut, "");
    } else {
      bot->sendMessage(chat_id, "Не корректный ввод. Ведите значение снова или отмените /stopTime", "");
    }
    return true;
  } else if (isSetTimeEnd && !command.isEmpty() && !command.startsWith("/stopTime")) {
    bool isValidEnd = isValidDateTime(command);

    if (isValidEnd) {

      isSetTimeEnd = false;

      std::pair<String, String> result = splitDateTime(command);

      control.scenario.endDate = result.first;
      control.scenario.endTime = result.second;

      control.scenario.useSetting = true;

      String sOut = "Успешно! Теплый пол будет включен с " + convertDateFormat(control.scenario.startDate) + " " + control.scenario.startTime + " по " + convertDateFormat(control.scenario.endDate) + " " + control.scenario.endTime + "\n";
      sOut += "Отменить /stopTime";
      isSaveControl = true;
      bot->sendMessage(chat_id, sOut, "");

    } else {
      bot->sendMessage(chat_id, "Не корректный ввод. Ведите значение снова или отмените /stopTime", "");
    }
    return true;

  } else if (command.startsWith("/stopTime")) {
    control.scenario.useSetting = false;

    if (!control.scenario.useSetting) {
      bot->sendMessage(chat_id, "Отключено", "");
      isSaveControl = true;
    } else {
      bot->sendMessage(chat_id, "Ошибка! Повторите ввод.", "");
    }

    return true;
  }
  //===============

  else if (command.startsWith("/help")) {
    String res = sendHelp();
    bot->sendMessage(chat_id, res, "");
    return true;

  } else if (command.startsWith("/resetFull")) {
    initializeControl();
    bot->sendMessage(chat_id, "Все параметры сброшены по умолчанию", "");
    isSaveControl = true;
    return true;

  } else if (command.startsWith("/debug")) {
    String outStr = debugInfo();
    bot->sendMessage(chat_id, outStr, "");
    return true;

  } else if (command.startsWith("/log")) {
    String outStr = "Log:\n";
    outStr += getLog();
    bot->sendMessage(chat_id, outStr, "");

    return true;
  }
  // Неизвестная команда
  else {
    Serial.println("Unknown command. Please use /help for help.");
    return false;
  }
}

//=================================

void handleNewMessages(int numNewMessages) {
  delay(10);
  //Serial.println(String(numNewMessages));

  for (int i = 0; i < numNewMessages; i++) {

    // Идентификатор чата запроса
    String chat_id = String(bot->messages[i].chat_id);
    CHAT_ID = chat_id;

    int message_id = bot->messages[i].message_id;
    String text = bot->messages[i].text;

    if (text.length() > 512) {
      bot->sendMessage(chat_id, "Ваше сообщение слишком длинное и было проигнорировано.", "");
      continue;
    }

    const TelegramUserID* user = getUserById(chat_id);
    if (user == nullptr) {
      bot->sendMessage(chat_id, "Access is denied, user does not exist", "");
      continue;
    }


    // Проверка доступа на чтение и запись
    if (!user->reading) {
      bot->sendMessage(chat_id, "Read access denied", "");
      continue;
    }

    if (!user->writing) {
      bot->sendMessage(chat_id, "Write access denied", "");
      continue;
    }

    Serial.println(text);

    //======КНОПКИ====
    if (handleTelegramCommand(chat_id, text)) {
    } else

      if (text == "/statusSystem") {
      bot->sendMessage(chat_id, getSystemStatus(), "");
    } else

      if (text == "/start") {
      bot->sendMessage(chat_id, "Hello", "");
    } else

      if (text == "/reset") {
      bot->sendMessage(chat_id, "Перезагрузка", "");
      delay(1000);
      res = true;
      delay(500);
    } else

      if (text == "/update") {
      isUpdate = true;

      String message = "Выберете файл прошивки .bin, контента .html или настроек .json📎. [Скачать прошивку](https://cloud.mail.ru/public/KtJ5/WgxbfXTrP)";
      sendMessageWithMarkdown(chat_id, message);

    } else if (isUpdate) {

      size_t file_size = bot->messages[i].file_size;
      String file_path = bot->messages[i].file_path;
      String file_name = bot->messages[i].file_name;

      size_t totalBytes = SPIFFS.totalBytes();
      size_t usedBytes = SPIFFS.usedBytes();
      size_t freeBytes = totalBytes - usedBytes;

      //      Serial.println(file_path);
      //      Serial.println(file_name);
      //      Serial.println(file_size);

      String extension = file_name.substring(file_name.lastIndexOf('.') + 1);

      bool sizeOk = freeBytes > file_size || extension == "bin";
      if (!sizeOk) {
        bot->sendMessage(chat_id, "Превышен размер файла. Свободно: " + String(freeBytes / 1024) + " KB. Размер файла: " + String(file_size / 1024) + " KB.", "");
      }

      if (sizeOk && file_size > 0 && file_path.length() > 10) {

        bot->sendMessage(chat_id, "Файл принят: " + file_name, "");

        if (extension == "bin") {
          file_name = "firmware.bin";  // Переименовываем файл так как длинные имена и с подчеркиванием все ломают
        }

        TaskParameters* params = new TaskParameters;
        params->filePath = file_path;  // Передаем путь к файлу
        params->fileName = file_name;  // Передаем имя файла

        delay(200);

        BaseType_t resultOta = xTaskCreate(
          otaUpdateTask,  // Функция задачи
          "OTA Update",   // Имя задачи
          8192,           // Размер стека
          params,         // Параметры задачи
          1,              // Приоритет
          NULL            // Дескриптор задачи
        );

        if (resultOta != pdPASS) {
          Serial.println("Failed to create OTA update task.");
          isUpdate = false;
          bot->sendMessage(chat_id, "Повторите попытку", "");
        }

        return;
      }
      //isUpdate = false;  // Сброс флага обновления перенесен в otaUpdateTask

    } else

      if (text == "/newtoken") {
      isNewToken = true;
      bot->sendMessage(chat_id, "Отправьте новый токен бота. Для создания бота: @BotFather", "");

    } else

      // не работает пока
      if (text.startsWith("/sendfile ")) {
        String fileNameSend = text.substring(10);
        String filePath = "/" + fileNameSend;

