XPavel86/ESp32UniversalRele/Settings.h
        sendFileToTg = SPIFFS.open(filePath, FILE_READ);
        if (!sendFileToTg) {
          Serial.println("Не удалось открыть файл для чтения");
          return;
        }

        String response = bot->sendMultipartFormDataToTelegram("sendDocument", "document", sendFileToTg.name(), "txt", chat_id, sendFileToTg.size(), isMoreDataAvailable, getNextByte, nullptr, nullptr);

        Serial.println("Ответ сервера: " + response);
        sendFileToTg.close();

      }

      else if (isNewToken) {
        text.trim();
        String botName = checkNewToken(text);
        bool isCheck = (botName != "") && isValidTokenFormat(text);

        if (isCheck) {
          String outStr = "Новый токен успешно применен, перейдите в новый телеграм бот: " + String("@") + botName;
          bot->sendMessage(chat_id, outStr, "");

          bot->updateToken(text);
          settings.telegramSettings.botId = text;

          saveSettings();

        } else {
          bot->sendMessage(chat_id, "Введеный токен не корректный или бот не существует", "");
        }

        isNewToken = false;
      } else

        if (text == "/format") {
        bot->sendMessage(chat_id, "Форматирование файловой системы", "");
        SPIFFS.format();
      } else

        if (text == "/list") {
        String listF = "Список файлов:\n";
        listF += listFiles();

        bot->sendMessage(chat_id, listF, "");
      } else if (text == "/networks") {
        String result = parseNetworkSettings(settings);
        bot->sendMessage(chat_id, result, "");
      }

    //=== END КНОПКИ =====//
    //return;
  }
  // return;
}
//==================


// Задача тиктака

void tikTak() {


  //  if (analogRead(35) < 2000) {
  //   enterSleepMode();
  // }

  controlTask();

  if ((!settings.isAP || !isStartedAP) && settings.isWifiTurnedOn && !isUpdate) {
    tiktak1++;
  } else {
    tiktak1 = 0;
  }

  if (!isConnectionAttempts) {
    tiktak2++;
  } else {
    tiktak2 = 0;
  }

  if (settings.isWifiTurnedOn && !isStartedAP && WiFi.status() == WL_DISCONNECTED && isConnectionAttempts) {
    tiktak3++;
  } else {
    tiktak3 = 0;
  }
}
